#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.password: Refreshing state... [id=a]Q%6P!A1ws91BeqoO[pRpUY6-H%QCtC]
azuread_application.default: Refreshing state... [id=a265a4ff-4043-4828-b70f-4cb02aa098ce]
azuread_service_principal.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1]
azuread_service_principal_password.default: Refreshing state... [id=05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1/password/3a965c14-cf28-497e-ab9d-63ace923e134]
azurerm_resource_group.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev]
azurerm_container_registry.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev]
azurerm_role_assignment.aks_network: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/087bacad-146d-6e16-a49c-0310ee96b017]
azurerm_role_assignment.aks_acr: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/6523de9a-ad70-1ba0-66fa-afe8e533ffb0]
azurerm_kubernetes_cluster.default: Refreshing state... [id=/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_container_registry.default has been deleted
  - resource "azurerm_container_registry" "default" {
      - admin_enabled                 = false -> null
      - anonymous_pull_enabled        = false -> null
      - data_endpoint_enabled         = false -> null
      - encryption                    = [
          - {
              - enabled            = false
              - identity_client_id = ""
              - key_vault_key_id   = ""
            },
        ] -> null
      - georeplication_locations      = [] -> null
      - georeplications               = [] -> null
      - id                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
      - location                      = "eastus2" -> null
      - login_server                  = "liatrioacrdev.azurecr.io" -> null
      - name                          = "liatrioacrdev" -> null
      - network_rule_bypass_option    = "AzureServices" -> null
      - network_rule_set              = [] -> null
      - public_network_access_enabled = true -> null
      - quarantine_policy_enabled     = false -> null
      - resource_group_name           = "liatrio-rg-dev" -> null
      - retention_policy              = [
          - {
              - days    = 7
              - enabled = false
            },
        ] -> null
      - sku                           = "Standard" -> null
      - tags                          = {} -> null
      - trust_policy                  = [
          - {
              - enabled = false
            },
        ] -> null
      - zone_redundancy_enabled       = false -> null
    }

  # azurerm_kubernetes_cluster.default has been deleted
  - resource "azurerm_kubernetes_cluster" "default" {
      - api_server_authorized_ip_ranges     = [] -> null
      - automatic_channel_upgrade           = "" -> null
      - disk_encryption_set_id              = "" -> null
      - dns_prefix                          = "tfq-liatrio-aks-dev" -> null
      - dns_prefix_private_cluster          = "" -> null
      - enable_pod_security_policy          = false -> null
      - fqdn                                = "tfq-liatrio-aks-dev-271e10dc.hcp.eastus2.azmk8s.io" -> null
      - id                                  = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerService/managedClusters/liatrio-aks-dev" -> null
      - kube_admin_config                   = [] -> null
      - kube_admin_config_raw               = (sensitive value)
      - kube_config                         = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUZIakNDQXdhZ0F3SUJBZ0lSQU1BQ3NoSUJGLytsUmJ1U3JYWUoxMjh3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpJd01qRXhNREV3T0RNeVdoY05NalF3TWpFeE1ERXhPRE15V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBdy83d2NCblZuNmVZMGhlSFJuaWEKMi9ta1hFSXVOK3dXSmtZNnhHdFI0ZzQ0NFc1K3FuVzZiT0xpTUo3WjIrK3RCalVIT01EMHpraWtVeVJHOVFwTgpYeFpoQksvVFlGR0xEZ2R3Z2pCeVVEZjV6WjZrUHFiQzdUaGszc085cG94VkxyL0xvUWNQdlJlNGp5azhIN0pwCk5xWXIrZkJ6L3hJWHV1Vk1wczYrbGFTM0xmOFlzMDkxQnEySmpFb3NESTI5cVhudlFsQmY5Y3NMazQ0VnBEU1UKalpScEdvTWwwODlhb3ZEbEdSbjFVdnh4bXFtSnQ3N2lpU1JYNjV4RWFiT0lEUFArUEFMc1hpNnJVMXRjdk1uUQozNFlRcTZSYkpSVU5MU3RMemdnZUZpZkt5dzlKK2NYL1FUZlNMTXFtcWp3SHRuVW50ak9hSlI3UnZnTHV4R3l6CjdqT0RWdnV6QlQ0Vmc4c2hTM1l5RFY1SzF3b2N6dFlUalFYU3did3pYMzVYV2JiM0s2elFVQk9KdUErZXlpYkoKWmE1WXNHcFBjeFJ6Y2xBbG9CMFp4TXE0ZTFQNWdtNHJmZktZNzhsMjVNQ0JSLzIrQlpmTmhHalJGdUpCeGhxZQpzUVFQKzl5TlhrYXo0MW1kN0tERi8rTFY0d2M2NHRCQndqY01wN1Z1MWdDbTlzcmRhU2g4TjcyT2tNdmVMTVBUCjNjY1hFY01Ydk1OTVdyYkt1U2J6VWFwYUdvclk5WE5IWFEwb21uV21RZ1JnWVBvTG1ESlIrdk9wb0c3Z0RVZ24KUTJOVGJPMzk3a24vcE1pU0lyZzFLaTBFYzFuKzkyK3V5N2hDY1JkaXdYem5zeDAvUW5sYnRvZzFXR3FQbDVRdApac2VCRnlCT0JhbzNvZ2pzL3hncWNNMENBd0VBQWFOV01GUXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdId1lEVlIwakJCZ3dGb0FVa1Z5andHZjIKdGdFVTlBRnNiN0dQbTUvdG90NHdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBSkcrMitrZGVHSEtTTkVPQ3IrdwphV3lDaFZpVE82Q1JPQ29vbW96ZFNyYWlFQmpXSStEemZzUGpJQzdqVWRPNzhtT0orV0NxYmFQcXBpRjNKSllrCjlNcDhWYnRzenpnL25Hc3NxOXpVWFU1eTlES1J5VzFCazFUQlFwanVVL2VMR1J5ci80TThKZ2JGWHpLRU1Bd2QKeWpCQ1pxQUVOM3cveFVOMEo4WWIyQnB2eS9Rb1FMMDdOeW5FU0U0YzhwbXlLZEh3ckllTXZjeXBXWERmK0tjNgpONWZKa1ZWUHNlQUxxaXBEZXNiTWRFZXZrcWJoVkNtUEVlS0NkcEtLOUJ3cGVhQzhma3hXdWpZSi96Y2QwOG5JCkV2RkFVSnhaNGt5V1Q4MEJzVHRMdW50ZGYyTzRGS2kxcmNzZWxsNTdTUjIzZzJYUU9rdDBvK1JhVE1XbUVMSlgKTTBsVE1DV2tDSHBpQnQ5TFAyMEhzN3AxREh1SzNCditqUkVkVGEyazVzK2lqRlFuSWFTbmRWR3JUaXVSSGhuQwpzMis0aGY5Zld0QWM4aXRqaFJWUkUyZ1BNdDVKd2Q3NVhmcUlERFRxblhQbE1xU3BsV0xVYU81YS96cnp4bnZUCjVGQ3Z4MUFuTnI5TTdQWWhPODl0ZXNDMDNmZ1lYTVhrRFg3ejZpR1pweFQweUFsYXJPbXRacTFaTzViQ3h0bCsKNCtWWmlDWWt5Qm5VdThuajcvcGJJUFpxMkFXN1laOTl3dTA0aFBDWStNa3VqVkhlM0F6OVFEN0VLbTBsczBPTwpRNWJnSnRqa1BJc01Ma3EzRlFXMVJRZldsUHdBZCtlRjZ0TFNRcUVlbjZpRktBRUdyVk5HVDdQempwWi9vNGswCngvYk5DcnpDbkRFRHBKbjlCUDI2ZG5vVAotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS3dJQkFBS0NBZ0VBdy83d2NCblZuNmVZMGhlSFJuaWEyL21rWEVJdU4rd1dKa1k2eEd0UjRnNDQ0VzUrCnFuVzZiT0xpTUo3WjIrK3RCalVIT01EMHpraWtVeVJHOVFwTlh4WmhCSy9UWUZHTERnZHdnakJ5VURmNXpaNmsKUHFiQzdUaGszc085cG94VkxyL0xvUWNQdlJlNGp5azhIN0pwTnFZcitmQnoveElYdXVWTXBzNitsYVMzTGY4WQpzMDkxQnEySmpFb3NESTI5cVhudlFsQmY5Y3NMazQ0VnBEU1VqWlJwR29NbDA4OWFvdkRsR1JuMVV2eHhtcW1KCnQ3N2lpU1JYNjV4RWFiT0lEUFArUEFMc1hpNnJVMXRjdk1uUTM0WVFxNlJiSlJVTkxTdEx6Z2dlRmlmS3l3OUoKK2NYL1FUZlNMTXFtcWp3SHRuVW50ak9hSlI3UnZnTHV4R3l6N2pPRFZ2dXpCVDRWZzhzaFMzWXlEVjVLMXdvYwp6dFlUalFYU3did3pYMzVYV2JiM0s2elFVQk9KdUErZXlpYkpaYTVZc0dwUGN4UnpjbEFsb0IwWnhNcTRlMVA1CmdtNHJmZktZNzhsMjVNQ0JSLzIrQlpmTmhHalJGdUpCeGhxZXNRUVArOXlOWGthejQxbWQ3S0RGLytMVjR3YzYKNHRCQndqY01wN1Z1MWdDbTlzcmRhU2g4TjcyT2tNdmVMTVBUM2NjWEVjTVh2TU5NV3JiS3VTYnpVYXBhR29yWQo5WE5IWFEwb21uV21RZ1JnWVBvTG1ESlIrdk9wb0c3Z0RVZ25RMk5UYk8zOTdrbi9wTWlTSXJnMUtpMEVjMW4rCjkyK3V5N2hDY1JkaXdYem5zeDAvUW5sYnRvZzFXR3FQbDVRdFpzZUJGeUJPQmFvM29nanMveGdxY00wQ0F3RUEKQVFLQ0FnRUFxbnJkVHRUWjRQWlowaHlQR1BnYzAweFE3OExOQ3UxNjBxM3h2aG9QYms2cW9VT0lQK01KVmw3LwpHZ1dDUUhFNGtoYWNBbnlzTTZZeDhQTzBHTDV1VUZCWjhVYXkyS3YxQlMzcGFnU1QyanptTnpsUGFnT0p0K2QrCnJkbWE0L3hhdDhBeWNnMS9YaDM4OWVHTEg1TURPM3JNODZsNGJCeWpzWGh6OVFBTi9JSDZwN0tsSElyM291aGQKcFQ1N0ZDeFNGZEV2RVFKeWhZeW90Qjg1cWN2bWowUFJMRE41T3NTNDlOUU9vb2ZXd09rK002WldXUkpiWDZqUwpKT21YQkU0YUFCSlhTSUhPY1ptc2dtUU14VlhTTGlzaDR2cWlJUjR2aU9PSkcxd3FOMkZEWHQ4Y25IcmhyU3ZOCjBCSXhhQSt4TWI2ejNTTURhRmhuWGh5VTdSd1VZSTZVNDljQng2THoyM04waHJsS0J5YlJFZjAzQjR0dmdLZlkKa2RUK3g3NEhBeit3Q0owM3lINzdiRUNuajhXdjRWdlg4VDRoNGVhZm9nNDZTb1p3ZVphRFVBcWxUdDkyWjR4bAoxTlpsU3FWRHZtMWdvZVhDK0NQSlpFamxaNXdZTjhJMitWUWxMd1VxZ0h2blZ3TmlJSlZxTlFjN040K09rc09lCmZXMDR6YUtxeVVRcUp6MXVnc29GQno5RkVSTGN2dmpNQkFZUVpTcmVzank1Rm53Rm5FZjNycERtalBXR1NETlYKSk5WaE4vTlpCTkd5aFdqcFl6aElmaGpma1VwcVlUYi93cWJlbjhtZDRRbVhkVHJuWDBxbTEvM0c0R0lqYWxlcgo2STFOSE90clZiRWFRK3o5TTF6WWdXSVcvdnFBb1NMaWVlVTRYQUNvOFZqMlZmSDZaWUVDZ2dFQkFONi9EYklsCndqL2FFTTJRQ2VIRS9DWFlNWmtIUEdCNTc2b3YybmJubFFtSmViWXVubzBMUU9VYlRTUFVEUmd2L3NmVWpTckUKL3VXbUxCN20rUmh1MzFPMlVyU3huSlNxbVNCdS9mYTJTVmFjbjVVRkNOQzhMRzZkZDNPbDFlMHdwaHAwUHNTQQpMbnYxVUVFdnNIOVJVOExUTnVsRnczckVpZ0c2Y0dkbHJ2Y3lOU1NCRDNOQmczYW5yRGN3MzNqVDFudE5sQVA3ClRCMXk3dVRmNmk1NGNGRFVJTTFBY0FuMThpeXQyeWpRUWp1c3dhdTl4TkVSZUxCWGNOaGlJbEZlaElqaG9TbVAKZldmZjE5TU1zTmdDWHFMQWo1NThxdHNCTFkrbm9iQTJwY09JdmRWUnllOXA3Y0dpRFcreFVNa0Y2Zmh0S1RYWApUdkczMmYyVW1rRmdGSzBDZ2dFQkFPRkJpS1BWTHhxNWJ1Z3NWVFhHR3VUNjdqTnhhQUE5cWhqTmdCck9OdjhBCmNlOGVvNkt4bWcrOG9RUnQ4NU1iZXBBRVVJOTFpMXVWQVdjRERrQVFOc1JabXpBajNydVEvQVJhQ1RGSjBMc1gKR0lXdkNOUkk3VnBDR2RVOExZaVNkWjh0c0RXTytKYk5GT0R6bmhZRVYrRUpVajZXT1JncFpZNU5LTDRLWmFldgpLaDdPdWNUTHNKWnRLdW8xUGc5MCtzT2hLT29RWlFMS3pybG5vRFBjbzg4b0N2bEw0WlhlMm1HcmxaZG15V0pNCkc1bVhZRWhJcXdoQkg1M25PMHowclRCcjhRVTduOHhISHBMSWw3TlFkeE9OeXRkcVpmREJNaGhrUmNEbWtqd2QKcmNvWEZBdmEwUXNJdzFxbHBydkhoa2NiS2tLMUhPYUxQZk9ic0lEeE1LRUNnZ0VCQUxDNjZZVDFUSUFZNXNnUwpocVNwQkY2S2dCK29qQkVIN2s0YmxieE4xZ1F4SFc2YzRwT0o0RDFuUWZjeFlncFUybE4ybzJMUjFtUWpTbEppCmREVWNrdmo2YWZpUUMyb3hTVGxnbHdQT2NiWFVveEU3WTFrcVZCNlh0WlQrZVJPdVM3d2xpeitoYkVCUnpSRkwKWTBCQktMSWxueVhLZ21TLzE3ZXpVMGZXZDlJTjlmZzJwaW1PUzE0emZ3SnpObnZKcUIxQTJqV21oeWUrYnlrTgpOK01URUJveGxLMEZlVitOMGszOHl5eEF3S3hVVDMyU0hieTduZ1JiL0Y3U3plTzltRzU2aHNKUTVQRXJ1elBxCmw4MXJZK2JCM2JHanZIUHpKVkViY2NBOE81MCt1MCtyaXdyNEF2cGxOei90Y2VsdFZjd1Q0R1NscGk5RzdpQ3kKYlFsOTBDa0NnZ0VCQUltQjN1N2NhZmZ2Y1JQTVZHd1NOa0xJSi9kQmFKS1ZFaXczN3RidVFjWmpPQ29YMHg2egpPbkFXMzFoNzRuQlFHdjZsazZRdnhsV3UzWDlMN3p3T2FkQnRQdjRoTjR2YTB1MjVKTmx3elRvWXZFQ0hmR1ZTCjY0bm94aXBVcFJzMUJSYVo1bktiaDRkUFJFcWFqVXUxZFF3TUM2Zm5QbzFRWUEyQmJyaXNVaWdPRnpGZFV5d2UKaC9zY1ExRmNGVG1NV0xScHdqYzRzT0VHZXpIVlg0ZXBUbHBjZ0c1MDh3M3hUL0RGdFBrS3B5OFpkTlBMQTl5OApkNlAvVlZTb1hwdjQxV3kweUJwQXJxa2VWVHlYdFh1aVNENm9sVVh4VHErczBHN3hiMTkxb1ptUEtKTXdpVzAvCk05Ti9rdm5ZRzdPUDlwbWJySzJ5TUNWUXBRMzhZY0FrL0dFQ2dnRUJBTU5MbzgwSFMzc2lPVjltL0N1V2VwL0wKMnFNUzFJZEFaa0FsRm1PUXFOeTNLSm4xVkE5d29TZEtoZXYvS2lTZzVUR3lCMWltaHBHNDlLdU9NRnBMZWpLTQpkTlhib0laLzU5Z3k2ZXZCWEM4bTRjaklVeDNMdHVsSzdEVCt6Y1VJTkdheWNzM3hpSUl0b3R5MkpOaUJPMnAzCmI4Um8xM3FXVTdnZFdGZWUvNk5DUWRVNld5V05TSVdNQlRiQm90TGZlSzltS1k1bjBVeVlESk0xdVdBaXNXZGwKd1BTZndFck5TdDRnWUwwWnRUMmRySHhxUnQ1STBldXFtWFhmWDRiMEt6bXcrem1NRVlmQThtcW9rUUZ2cm9KMAp6RnE4bXpZaUlnK1d6NlhhRkhtWkk2bEJiVytDb2svU0pNVWNEcWl6TnpPMHZLUUdpcVRlYTNWVUs1TnF4c0U9Ci0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg=="
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUU2VENDQXRHZ0F3SUJBZ0lSQU5RV1lqWHdGSWdyc3ZaSk10Vnl1QWN3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpJd01qRXhNREV3T0RNeVdoZ1BNakExTWpBeU1URXdNVEU0TXpKYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCm85alRWSVNNOUJXenJ2UmRtS0E2QUs5LzFCc2FxekFRNWFQaWd1eUtFNVNObVQvL21IcWZ2R0RPTU1wZG1xaXkKL3ZkZFF4a2owakhSL2ovWjZwMjdWdWJtRnNRSzVUWnRUNSs5YWhwaVl6T0FXNTFHRlNoOEhhRGRjR3loNFFsbAo2T281THJ0bmJyRGVLekdPRHltRTE4eC93bE9DY29DWUZUanJiL3gwTkt6azhuMDRJOTUzTUxDUmFxL1ppVHVRCkNhSFVRUThQM3FYTDQwNHkzWisvcE9PczRtdlpaTXRuR1NSMnBaM3M4Rk0yTW9nOHNjVklkTzduWXNzcTJxZisKQUdSSGhncW5SWm5KTk1aVUY1UUZWTS9laGFVSmhPanExSmkyRUgyenVNRFNsSUgrdWIvMFNpT0Jsb1ZTUytiaAprQUticEhsc2FvTU9nMk42aHpPbEVQcThmMkZBdlYyL2lzZS9tTVhweXR1NEpHSlpNTVB4R2Q0SW80SndSZnRsCm83ckhXNktMeE5FSVpmcFhaNFVBRGZlSHFnQkl6Y09iUUw4OG9JUzd0Sll1WWJwVXFud2FKdkVOYmFlM2dUcHgKSXhXMGNmeWFPWG5GY3J3SVdHYTJaeTB1V3VKeHpIc0FZSFN5bytWbjI0UjhOR1hlMHMxOU1MU0dMVGc2dWp2VwptTmdrOGNpNkpjbzNIK3RuVUNBb0dYdmlNYURSVjJ1ZGtydGw2SFYzSmRKK0JFYWg4WkNtSXJ0dmFXaGNCemRPCnlQK0gzTVpkdVBWdUVOdDhzYnVQSTJWNm0zUFYreEIyOTIzVW1tN3FnSzBOQ2lzSE9tTXdQMFZ4NzZ4ZEJ2bzUKUlpwUDZHVXd3VlFHMGpwcnRQMVgrVXE3MlB0RGNDK2dJR1JHNk1COU9hMENBd0VBQWFOQ01FQXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGSkZjbzhCbjlyWUJGUFFCCmJHK3hqNXVmN2FMZU1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQ0FRQXB5eXo1dnlYUnczRGpNOXRTTGU1dUFDalYKV1BTMy92RkNYcTBEN3NCS29DVENSZ3psWnJNNjlWWDEyVGVjM0d1U1BRcE5Xb3hUbHQ3RTBrZEZpSWNDdENzbwp4clJYdzlVclBFR2JBTFJoazhCdFVOZzVvSDBRUzgvNWxrVVRaSkpYc3MrQjJ3dWZPcFJNYlhmUXlERzRZcXNYCnY4M1ZqVlR1VTlQZE02RVh1VjQrZi9YQmx4SlFaUnhOQWZMNDFFTE1obWhhd2hsOE15bjQxQ0F4NVQ0ZjlmbjIKUkYxQ0VqU0g2TENsc09VK1BxcHpZejI1eDBOeXpDdGE1RW5zcWF1S2dSYklOdjlXUHRQNk5YZ2owaFBCazNLeQpSaGo1YVQvbHJpUUZqTDdXS1QxVjhQd3F3UGxzK212UnVGR0hORVkveThPemxaR0NLMzVFKytQTFJ5dlArQzlaCitrbjN2N2U5aVFyVGNuWTE0cFcyaHJKRmZZeFVmWkF4SEpZODRMSTVlRDFLWG5ZWFYxTllqN0tzbWltUjN5VWgKSHNxN0lMK2ZzN1lYTDEyZGl5aUQyQ1Z4Q2NmWUpXSTBYblhKRW5QQXpVZnRaSzBqS2dJd3hxa1IvYysxcU96UgptSFcraDROZmV5RWZFZDRxb1l4VW9jalNqT05jMkU4MmtrVUNPMDR2YW0wbFZ3UE1GOVNMSVhiL0dkYWxINEVXCm9DMmcvM2IrblJEYkd1MEZaZ2VTa2RPZHRrOWtsNWhkcElDTitlanVXYlZ1VlpHRktCVFIzYUQ5SFNEN1p2VjUKV05McmxSOHhQR1VvYVFuL2lLanQyM2w1RHNFRkYyREwrL1lHN2lrNnFBbmVVWkZVM1NuUm9qeWdiVXdSbzFhbApjcFdhTUJycGQ2WkZkY0Nva0E9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://tfq-liatrio-aks-dev-271e10dc.hcp.eastus2.azmk8s.io:443"
              - password               = "6dacac8b42ec69e3fd74347012829fe56367c91c454dc20e59b0f05f0596b9b21a8e0d6b339cad7c0b84daf0261d8fd731393dc8181cca3863f9158b8b819aac"
              - username               = "clusterUser_liatrio-rg-dev_liatrio-aks-dev"
            },
        ] -> null
      - kube_config_raw                     = (sensitive value)
      - kubernetes_version                  = "1.21.7" -> null
      - local_account_disabled              = false -> null
      - location                            = "eastus2" -> null
      - name                                = "liatrio-aks-dev" -> null
      - node_resource_group                 = "MC_liatrio-rg-dev_liatrio-aks-dev_eastus2" -> null
      - portal_fqdn                         = "tfq-liatrio-aks-dev-271e10dc.portal.hcp.eastus2.azmk8s.io" -> null
      - private_cluster_enabled             = false -> null
      - private_cluster_public_fqdn_enabled = false -> null
      - private_dns_zone_id                 = "" -> null
      - private_fqdn                        = "" -> null
      - private_link_enabled                = false -> null
      - public_network_access_enabled       = true -> null
      - resource_group_name                 = "liatrio-rg-dev" -> null
      - sku_tier                            = "Free" -> null
      - tags                                = {} -> null

      - addon_profile {
          - aci_connector_linux {
              - enabled = false -> null
            }

          - azure_keyvault_secrets_provider {
              - enabled                 = false -> null
              - secret_identity         = [] -> null
              - secret_rotation_enabled = false -> null
            }

          - azure_policy {
              - enabled = false -> null
            }

          - http_application_routing {
              - enabled = false -> null
            }

          - ingress_application_gateway {
              - enabled                              = false -> null
              - ingress_application_gateway_identity = [] -> null
            }

          - kube_dashboard {
              - enabled = false -> null
            }

          - oms_agent {
              - enabled            = false -> null
              - oms_agent_identity = [] -> null
            }

          - open_service_mesh {
              - enabled = false -> null
            }
        }

      - default_node_pool {
          - availability_zones           = [] -> null
          - enable_auto_scaling          = false -> null
          - enable_host_encryption       = false -> null
          - enable_node_public_ip        = false -> null
          - fips_enabled                 = false -> null
          - kubelet_disk_type            = "OS" -> null
          - max_count                    = 0 -> null
          - max_pods                     = 110 -> null
          - min_count                    = 0 -> null
          - name                         = "default" -> null
          - node_count                   = 1 -> null
          - node_labels                  = {} -> null
          - node_taints                  = [] -> null
          - only_critical_addons_enabled = false -> null
          - orchestrator_version         = "1.21.7" -> null
          - os_disk_size_gb              = 128 -> null
          - os_disk_type                 = "Managed" -> null
          - os_sku                       = "Ubuntu" -> null
          - tags                         = {} -> null
          - type                         = "VirtualMachineScaleSets" -> null
          - ultra_ssd_enabled            = false -> null
          - vm_size                      = "Standard_D2_v2" -> null
        }

      - network_profile {
          - dns_service_ip     = "10.0.0.10" -> null
          - docker_bridge_cidr = "172.17.0.1/16" -> null
          - load_balancer_sku  = "Standard" -> null
          - network_plugin     = "kubenet" -> null
          - outbound_type      = "loadBalancer" -> null
          - pod_cidr           = "10.244.0.0/16" -> null
          - service_cidr       = "10.0.0.0/16" -> null

          - load_balancer_profile {
              - effective_outbound_ips    = [
                  - "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/MC_liatrio-rg-dev_liatrio-aks-dev_eastus2/providers/Microsoft.Network/publicIPAddresses/02bc3212-6849-452f-b580-e7b813b7e9ef",
                ] -> null
              - idle_timeout_in_minutes   = 0 -> null
              - managed_outbound_ip_count = 1 -> null
              - outbound_ip_address_ids   = [] -> null
              - outbound_ip_prefix_ids    = [] -> null
              - outbound_ports_allocated  = 0 -> null
            }
        }

      - role_based_access_control {
          - enabled = true -> null
        }

      - service_principal {
          - client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1" -> null
          - client_secret = (sensitive value)
        }
    }

  # azurerm_resource_group.default has been deleted
  - resource "azurerm_resource_group" "default" {
      - id       = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
      - location = "eastus2" -> null
      - name     = "liatrio-rg-dev" -> null
      - tags     = {} -> null
    }

  # azurerm_role_assignment.aks_acr has been deleted
  - resource "azurerm_role_assignment" "aks_acr" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev/providers/Microsoft.Authorization/roleAssignments/6523de9a-ad70-1ba0-66fa-afe8e533ffb0" -> null
      - name                 = "6523de9a-ad70-1ba0-66fa-afe8e533ffb0" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> null
      - role_definition_name = "Reader" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev" -> null
    }

  # azurerm_role_assignment.aks_network has been deleted
  - resource "azurerm_role_assignment" "aks_network" {
      - id                   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.Authorization/roleAssignments/087bacad-146d-6e16-a49c-0310ee96b017" -> null
      - name                 = "087bacad-146d-6e16-a49c-0310ee96b017" -> null
      - principal_id         = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> null
      - role_definition_name = "Network Contributor" -> null
      - scope                = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.default will be created
  + resource "azurerm_container_registry" "default" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + georeplication_locations      = (known after apply)
      + georeplications               = (known after apply)
      + id                            = (known after apply)
      + location                      = "eastus2"
      + login_server                  = (known after apply)
      + name                          = "liatrioacrdev"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "liatrio-rg-dev"
      + retention_policy              = (known after apply)
      + sku                           = "Standard"
      + storage_account_id            = (known after apply)
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_kubernetes_cluster.default will be created
  + resource "azurerm_kubernetes_cluster" "default" {
      + dns_prefix                          = "tfq-liatrio-aks-dev"
      + fqdn                                = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (known after apply)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (known after apply)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus2"
      + name                                = "liatrio-aks-dev"
      + node_resource_group                 = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = (known after apply)
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + private_link_enabled                = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "liatrio-rg-dev"
      + sku_tier                            = "Free"

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_keyvault_secrets_provider {
              + enabled                  = (known after apply)
              + secret_identity          = (known after apply)
              + secret_rotation_enabled  = (known after apply)
              + secret_rotation_interval = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + ingress_application_gateway {
              + effective_gateway_id                 = (known after apply)
              + enabled                              = (known after apply)
              + gateway_id                           = (known after apply)
              + gateway_name                         = (known after apply)
              + ingress_application_gateway_identity = (known after apply)
              + subnet_cidr                          = (known after apply)
              + subnet_id                            = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
              + oms_agent_identity         = (known after apply)
            }

          + open_service_mesh {
              + enabled = (known after apply)
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + empty_bulk_delete_max            = (known after apply)
          + expander                         = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + max_node_provisioning_time       = (known after apply)
          + max_unready_nodes                = (known after apply)
          + max_unready_percentage           = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
          + skip_nodes_with_local_storage    = (known after apply)
          + skip_nodes_with_system_pods      = (known after apply)
        }

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2_v2"
        }

      + kubelet_identity {
          + client_id                 = (known after apply)
          + object_id                 = (known after apply)
          + user_assigned_identity_id = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_mode       = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + outbound_type      = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }

          + nat_gateway_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = "9610f47c-08fb-4b94-ae1d-8ad2f8fb57e1"
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
          + license        = (known after apply)
        }
    }

  # azurerm_resource_group.default will be created
  + resource "azurerm_resource_group" "default" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "liatrio-rg-dev"
    }

  # azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev/providers/Microsoft.ContainerRegistry/registries/liatrioacrdev"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_network will be created
  + resource "azurerm_role_assignment" "aks_network" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "05cd3ee5-0f0e-47a3-bf6f-990c94cd43e1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = "/subscriptions/5dcb44a6-974d-4ca9-801d-2b68abcad57c/resourceGroups/liatrio-rg-dev"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @husseinsa, Action: `pull_request`*